
## Plan Result (aws/main)

[CI link](https://github.com/grimoh/infrastructure/actions/runs/5186335313)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_kms_alias.tf_confidential


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_kms_alias.tf_confidential will be created
  + resource "aws_kms_alias" "tf_confidential" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/tf-confidential-aws-main"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "80806601-e5ae-4304-a71e-4c79ee7473dd"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":195,"Program":"tfcmt","SHA1":"25fa88e60a969070e71cb6cc3ebc63b852a735ce","Target":"aws/main","Vars":{},"WorkflowName":"test"} -->